ext_alsav/InformationRegisters/алсав_СоставИзделий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>алсав_СоставИзделий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВУзле</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьВСборкеНоменклатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолуфабрикат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоМатериалы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/AccumulationRegisters/ГрафикОтгрузкиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрафикОтгрузкиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоНеобеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПодЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоИзЗаказов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/ТоварныеОграничения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварныеОграничения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МинимальноеКоличествоЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МаксимальноеКоличествоЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МетодОбеспеченияПотребностей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыОбеспеченияПотребностей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтраховоеКоличествоЗапаса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбеспечениеЗаказовПриПоддержанииЗапаса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбеспечениеЗаказовПриПоддержанииЗапаса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НормаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УпаковкаЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СреднедневноеПотребление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СреднееОтклонениеПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРасчетаРекомендаций</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоДействующийПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьРекомендацияПоИзменению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоГруппировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Группировка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппировкиТоварныхОграничений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/CommonModules/алсав_Ozon_РаботаСОстаткамиУТ/Ext/Module.bsl
Функция КорректировкаТекстЗапросаОстаткиНоменклатуры(ТекстЗапроса) Экспорт
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВтОстатки","ПОМЕСТИТЬ ОригиналВтОстатки");
	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Временная таблица ""ВтОстатки""","
	|// Временная таблица ""ВтОстатки""
	|ВЫБРАТЬ
	|	Т.ПродуктНоменклатура Номенклатура,
	|	Т.ПродуктХарактеристика Характеристика,
	|	Т.Склад КАК Склад,
	|	MIN(Т.ВозможностьСобрать) ВНаличии,
	|	0 КАК ПриходПлановый,
	|	0 КАК ВРезерве,
	|	0 КАК Котгрузке,
	|	0 КАК ПланОтгрузки    
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|(	ВЫБРАТЬ
	|		ТОсновнаяВыборка.Доступно КАК Доступно,
	|		ТОсновнаяВыборка.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|		ТОсновнаяВыборка.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|		ТОсновнаяВыборка.Склад,
	|		ВЫБОР
	|			КОГДА (ТОсновнаяВыборка.Доступно - ТОсновнаяВыборка.ВЗаказеОплаченоНеОбеспечено) < ТОсновнаяВыборка.КоличествоУпаковок ТОГДА 0
	|			ИНАЧЕ ВЫРАЗИТЬ((ТОсновнаяВыборка.Доступно - ТОсновнаяВыборка.ВЗаказеОплаченоНеОбеспечено) / ТОсновнаяВыборка.КоличествоУпаковок - 0.5 КАК ЧИСЛО(10, 0))
	|		КОНЕЦ КАК ВозможностьСобрать
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ЕСТЬNULL(ОстаткиИРезерв.ВНаличииОстаток, 0) - ЕСТЬNULL(ОстаткиИРезерв.ВРезервеСоСкладаОстаток, 0) - ЕСТЬNULL(ОстаткиИРезерв.ВРезервеПодЗаказОстаток, 0) КАК Доступно,
	|			ТСпецификация.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|			ТСпецификация.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|			ТСпецификация.Номенклатура КАК Номенклатура,
	|			ТСпецификация.Характеристика КАК Характеристика,
	|			ТСпецификация.КоличествоУпаковок КАК КоличествоУпаковок,
	|			ТСпецификация.Склад,
	|			ISNULL(ОстаткиИРезерв.ВНаличииОстаток,0) КАК ВНаличииОстаток,
	|			ISNULL(Заказы.КОтгрузке,0) КОтгрузке,
	|			ISNULL(Заказы.НеОбеспечено,0) НеОбеспечено,
	|			ISNULL(Заказы.ВЗаказеВсе,0) ВЗаказеВсе,
	|			ISNULL(Заказы.ВЗаказе,0) ВЗаказе,
	|			ISNULL(Заказы.ВРезерве,0) ВРезерве,
	|			ISNULL(Заказы.ВЗаказеОплачено,0) ВЗаказеОплачено,
	|			ISNULL(Заказы.ВЗаказеОплаченоНеОбеспечено,0) ВЗаказеОплаченоНеОбеспечено,
	|			ISNULL(Заказы.ВЗаказеНЕОплачено,0) ВЗаказеНЕОплачено
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Т.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|				Т.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|				Т.Номенклатура КАК Номенклатура,
	|				Т.Характеристика КАК Характеристика,
	|				Склад.Ссылка КАК Склад,
	|				СУММА(Т.КоличествоУпаковок) КАК КоличествоУпаковок
	|			ИЗ
	|				(ВЫБРАТЬ
	|					алсав_СоставИзделий.ПродуктНоменклатура КАК ПродуктНоменклатура,
	|					алсав_СоставИзделий.ПродуктХарактеристика КАК ПродуктХарактеристика,
	|					алсав_СоставИзделий.Номенклатура КАК Номенклатура,
	|					алсав_СоставИзделий.Характеристика КАК Характеристика,
	|					алсав_СоставИзделий.Количество КАК КоличествоУпаковок
	|				ИЗ
	|					РегистрСведений.алсав_СоставИзделий КАК алсав_СоставИзделий
	|				ГДЕ
	|					алсав_СоставИзделий.ЭтоМатериалы = ЛОЖЬ
	|					И алсав_СоставИзделий.ЭтоПолуфабрикат = ЛОЖЬ
	|			UNION ALL
	|			ВЫБРАТЬ DISTINCT
	|				Номенклатура.Ссылка КАК ПродуктНоменклатура,
	|				ХарактеристикиНоменклатуры.Ссылка КАК ПродуктХарактеристика,
	|				Номенклатура.Ссылка КАК Номенклатура,
	|				ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	|				1 КАК КоличествоУпаковок
	|			ИЗ
	|				Справочник.Номенклатура	КАК Номенклатура
	|				LEFT JOIN Справочник.ХарактеристикиНоменклатуры КАК	ХарактеристикиНоменклатуры
	|					ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	|
	|				INNER JOIN Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_Активен
	|		        	ПО ДР_Активен.Ссылка = Номенклатура.Ссылка
	|		        		И (ДР_Активен.Свойство.Заголовок = ""Активность на сайте"")
	|		        		И (ДР_Активен.Значение.Наименование = ""Да"")
	|
	|		        INNER JOIN Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДР_ТипСкладскогоУчета
	|		        	ПО ДР_ТипСкладскогоУчета.Ссылка = Номенклатура.Ссылка
	|		        		И (ДР_ТипСкладскогоУчета.Свойство.Заголовок = ""Тип складского учета"")
	|		        		И (ДР_ТипСкладскогоУчета.Значение.Наименование = ""Одна упаковка"")
	|
	|			) КАК Т
	|
	|			LEFT JOIN Справочник.Склады КАК Склад ПО Склад.Ссылка В(&Склады)
	|
	|			СГРУППИРОВАТЬ ПО
	|				Т.ПродуктНоменклатура,
	|				Т.ПродуктХарактеристика,
	|				Т.Номенклатура,
	|				Т.Характеристика,
	|				Склад.Ссылка
	|		) КАК ТСпецификация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				ВТ_Заказы.Номенклатура КАК Номенклатура,
	|				ВТ_Заказы.Характеристика КАК Характеристика,
	|				ВТ_Заказы.Склад КАК Склад,
	|				СУММА(ВТ_Заказы.КОтгрузке) КАК КОтгрузке,
	|				СУММА(ВТ_Заказы.НеОбеспечено) КАК НеОбеспечено,
	|				СУММА(ВТ_Заказы.ВРезерве) + СУММА(ВТ_Заказы.КОтгрузке) + СУММА(ВТ_Заказы.НеОбеспечено) КАК ВЗаказеВсе,
	|				СУММА(ВТ_Заказы.НеОбеспечено) КАК ВЗаказе,
	|
	|				СУММА(ЕСТЬNULL(ВТ_Заказы.ВРезерве, 0) + ЕСТЬNULL(ВТ_Заказы.КОтгрузке, 0)) КАК ВРезерве,
	|
	|				СУММА(ВЫБОР
	|					КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	|							ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	|						ТОГДА ISNULL(ВТ_Заказы.ВРезерве,0) + ISNULL(ВТ_Заказы.КОтгрузке,0) + ISNULL(ВТ_Заказы.НеОбеспечено,0)
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ВЗаказеОплачено,
	|
	|				СУММА(ВЫБОР
	|					КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	|							ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	|						ТОГДА ISNULL(ВТ_Заказы.НеОбеспечено,0)
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК ВЗаказеОплаченоНеОбеспечено,
	|
	|				СУММА(ВЫБОР
	|					КОГДА ЕСТЬNULL(ГрафикОплаты.ПроцентКредита, 0) >= 100 - ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0)
	|							ИЛИ СостоянияЗаказов.ЕстьОплата = ИСТИНА
	|						ТОГДА 0
	|					ИНАЧЕ ISNULL(ВТ_Заказы.ВРезерве,0) + ISNULL(ВТ_Заказы.КОтгрузке,0) + ISNULL(ВТ_Заказы.НеОбеспечено,0)
	|				КОНЕЦ) КАК ВЗаказеНЕОплачено
	|			ИЗ
	|				(ВЫБРАТЬ
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Номенклатура, ВТ_Заказы.Номенклатура) КАК Номенклатура,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Характеристика, ВТ_Заказы.Характеристика) КАК Характеристика,
	|					ВТ_Заказы.Склад КАК Склад,
	|					ВТ_Заказы.Заказ КАК Заказ,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.ВРезерве КАК ВРезерве,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.КОтгрузке КАК КОтгрузке,
	|					ЕСТЬNULL(ВТ_ВариантыКомплектацииНоменклатуры.Количество, 1) * ВТ_Заказы.НеОбеспечено КАК НеОбеспечено
	|				ИЗ
	|					(
	|					ВЫБРАТЬ
	|						ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|						ТоварыКОтгрузке.Характеристика КАК Характеристика,
	|						ТоварыКОтгрузке.Склад КАК Склад,
	|						ТоварыКОтгрузке.ДокументОтгрузки КАК Заказ,
	|						ТоварыКОтгрузке.ВРезервеОстаток КАК ВРезерве,
	|						ТоварыКОтгрузке.КОтгрузкеОстаток КАК КОтгрузке,
	|						0 КАК НеОбеспечено
	|					ИЗ
	|						РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад.Ссылка В(&Склады) И NOT (ДокументОтгрузки ССЫЛКА Документ.ЗаказНаСборку)) КАК ТоварыКОтгрузке
	|
	|					ОБЪЕДИНИТЬ ВСЕ
	|
	|					ВЫБРАТЬ
	|						ГрафикОтгрузкиТоваров.Номенклатура,
	|						ГрафикОтгрузкиТоваров.Характеристика,
	|						ГрафикОтгрузкиТоваров.Склад,
	|						ГрафикОтгрузкиТоваров.Регистратор  КАК Заказ,
	|						0 КАК ВРезерве,
	|						0 КАК КОтгрузке,
	|						ГрафикОтгрузкиТоваров.КоличествоНеобеспечено КАК НеОбеспечено
	|					ИЗ
	|						РегистрНакопления.ГрафикОтгрузкиТоваров КАК ГрафикОтгрузкиТоваров) КАК ВТ_Заказы
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ (	ВЫБРАТЬ
	|								состав.ВариантКомплектацииНоменклатуры КАК Ссылка,
	|								состав.ПродуктНоменклатура КАК НоменклатураОсновногоКомпонента,
	|								состав.ПродуктХарактеристика КАК ХарактеристикаОсновногоКомпонента,
	|								состав.ПутьВСборке КАК НоменклатураПутьСборки,
	|								состав.Номенклатура КАК Номенклатура,
	|								состав.Характеристика КАК Характеристика,
	|								состав.Количество КАК Количество,
	|								состав.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат
	|
	|							ИЗ
	|								РегистрСведений.алсав_СоставИзделий КАК состав
	|							ГДЕ
	|								состав.ЭтоПолуфабрикат = ЛОЖЬ
	|								И состав.ЭтоМатериалы = ЛОЖЬ
	|					) КАК ВТ_ВариантыКомплектацииНоменклатуры
	|					ПО (ВТ_ВариантыКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = ВТ_Заказы.Номенклатура)
	|						И (ВТ_ВариантыКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = ВТ_Заказы.Характеристика)) КАК ВТ_Заказы
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ (
	|							ВЫБРАТЬ
	|								СостоянияЗаказов.Заказ КАК ЗаказКлиента,
	|								ВЫБОР
	|									КОГДА СостоянияЗаказов.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяАвансДоОбеспечения), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки))
	|										ТОГДА ЛОЖЬ
	|									ИНАЧЕ ИСТИНА
	|								КОНЕЦ КАК ОплаченПоУсловиюСоглашения,
	|								ВЫБОР
	|									КОГДА ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) >= 10
	|										ТОГДА ИСТИНА
	|									ИНАЧЕ ЛОЖЬ
	|								КОНЕЦ КАК ЕстьОплата,
	|								СостоянияЗаказов.ПроцентОплаты КАК ПроцентОплаты
	|							ИЗ
	|								РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказов) КАК СостоянияЗаказов
	|					ПО (СостоянияЗаказов.ЗаказКлиента = ВТ_Заказы.Заказ)
	|
	|					ЛЕВОЕ СОЕДИНЕНИЕ (
	|						ВЫБРАТЬ
	|							ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|							СУММА(ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа) КАК ПроцентКредита
	|						ИЗ
	|							Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
	|						ГДЕ
	|							ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка.Проведен = ИСТИНА
	|							И ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
	|
	|						СГРУППИРОВАТЬ ПО
	|							ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка) КАК ГрафикОплаты
	|					ПО (ГрафикОплаты.Ссылка = ВТ_Заказы.Заказ)
	|					
	|					GROUP BY
	|						ВТ_Заказы.Номенклатура,
	|						ВТ_Заказы.Характеристика,
	|						ВТ_Заказы.Склад
	|					) КАК Заказы
	|			ПО ТСпецификация.Номенклатура = ТСпецификация.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = Заказы.Характеристика)
	|				И ТСпецификация.Склад = Заказы.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ (
	|					ВЫБРАТЬ
	|						Номенклатура,
	|						Характеристика,
	|						Ссылка.Склад КАК Склад,
	|						SUM(Количество) AS Количество
	|					ИЗ Документ.РеализацияТоваровУслуг.Товары
	|					ГДЕ Ссылка.Дата > НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период,ДЕНЬ,-120),ДЕНЬ)
	|					GROUP BY Номенклатура,Характеристика,Ссылка.Склад
	|				) КАК Продажи
	|			ПО ТСпецификация.Номенклатура = Продажи.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = Продажи.Характеристика)
	|				И ТСпецификация.Склад = Продажи.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	|			ПО ТСпецификация.Номенклатура = ТоварныеОграничения.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = ТоварныеОграничения.Характеристика)
	|				И ТСпецификация.Склад = ТоварныеОграничения.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, Склад.Ссылка В(&Склады)) КАК ГрафикПоступления
	|			ПО ТСпецификация.Номенклатура = ГрафикПоступления.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = ГрафикПоступления.Характеристика)
	|				И ТСпецификация.Склад = ГрафикПоступления.Склад
	|
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(,Склад.Ссылка В(&Склады) ) КАК ОстаткиИРезерв
	|			ПО ТСпецификация.Номенклатура = ОстаткиИРезерв.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = ОстаткиИРезерв.Характеристика)
	|				И ТСпецификация.Склад = ОстаткиИРезерв.Склад
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад.Ссылка В(&Склады) И NOT (ДокументОтгрузки ССЫЛКА Документ.ЗаказНаСборку)) КАК Т_КОтгрузке
	|			ПО ТСпецификация.Номенклатура = Т_КОтгрузке.Номенклатура
	|				И (ТСпецификация.Характеристика IS NULL OR ТСпецификация.Характеристика = Т_КОтгрузке.Характеристика)
	|				И ТСпецификация.Склад = Т_КОтгрузке.Склад
	|
	|		) КАК ТОсновнаяВыборка
	|	) AS Т
	|	//WHERE ПродуктНоменклатура.Наименование
	|	//= ""AL 768 Кресло офисное, ткань/сетка""
	|	//LIKE ""6МБК%""
	|GROUP BY
	|	Т.ПродуктНоменклатура,
	|	Т.ПродуктХарактеристика,
	|	Т.Склад
	|
	|
	|;
	|");

	Возврат ТекстЗапроса;
КонецФункции
